astb_relise/src/Documents/УстановкаПериодаЗимы/УстановкаПериодаЗимы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаПериодаЗимы</name>
  <registerRecords>AccumulationRegister.ПотребностьВыдачиСИЗ</registerRecords>
  <registerRecords>InformationRegister.ПериодыЗимы</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаПоПотребности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПериодыЗимы</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоЗимы</name>
      <type>
        <types>EnumRef.МесяцыГода</types>
      </type>
    </attributes>
    <attributes>
      <name>КонецЗимы</name>
      <type>
        <types>EnumRef.МесяцыГода</types>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/InformationRegisters/ПериодыЗимы/ПериодыЗимы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПериодыЗимы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НачалоЗимы</name>
    <type>
      <types>EnumRef.МесяцыГода</types>
    </type>
  </resources>
  <resources>
    <name>КонецЗимы</name>
    <type>
      <types>EnumRef.МесяцыГода</types>
    </type>
  </resources>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Documents/УстановкаПериодаЗимы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	УстановкаПериодаЗимыПериодыЗимы.Ссылка.Дата КАК Период,
	|	УстановкаПериодаЗимыПериодыЗимы.Ссылка.Организация,
	|	УстановкаПериодаЗимыПериодыЗимы.Подразделение,
	|	УстановкаПериодаЗимыПериодыЗимы.НачалоЗимы,
	|	УстановкаПериодаЗимыПериодыЗимы.КонецЗимы,
	|	УстановкаПериодаЗимыПериодыЗимы.Использовать
	|ИЗ
	|	Документ.УстановкаПериодаЗимы.ПериодыЗимы КАК УстановкаПериодаЗимыПериодыЗимы
	|ГДЕ
	|	УстановкаПериодаЗимыПериодыЗимы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	//по регистру "Периоды зимы"
	ТаблицыДляДвижений.Вставить("ТаблицаПериодыЗимы", Запрос.Выполнить().Выгрузить());
	
	//по регистру "ПотребностьВыдачиСИЗ"
	ТаблицыДляДвижений.Вставить("ТаблицаПотребностьВыдачиСИЗ", ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуДвиженийПоПотребности(ДокументСсылка));
	
	//по регистру "ВыдачаПоПотребности"
	ТаблицыДляДвижений.Вставить("ТаблицаВыдачаПоПотребности", ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуДвиженийВыдачиПоПотребности(ДокументСсылка,ТаблицыДляДвижений.ТаблицаПотребностьВыдачиСИЗ));
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧасть(ТекущийОбъект) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПериодыЗимыСрезПоследних.Подразделение,
	|	ПериодыЗимыСрезПоследних.НачалоЗимы,
	|	ПериодыЗимыСрезПоследних.КонецЗимы,
	|	ПериодыЗимыСрезПоследних.Использовать КАК Использовать
	|ИЗ
	|	РегистрСведений.ПериодыЗимы.СрезПоследних(&Период, Организация = &Организация) КАК ПериодыЗимыСрезПоследних";
	
	Запрос.УстановитьПараметр("Период",		ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Организация",ТекущийОбъект.Организация);
	
	ТекущийОбъект.ПериодыЗимы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
	
#КонецЕсли
